[Warcries.A_Attention_Buff_Creature_ArtillerySupportUpgrade H7BaseBuff]
mName="立正！"
mTooltip="%stat1 %ICON_ATTACK 攻击\n%stat2 %ICON_DEFENSE 防御\n当该生物反击时，攻击型战争单位也会向攻击者射击。\n持续 %durnow 战斗回合。"

[Warcries.A_Engage_Buff_Hero H7BaseBuff]
mName="冲锋！"
mTooltip="所有友方近战生物拥有 %buff.buff.stat %buff.buff.stat.icon 攻击，只要此战嚎处于激活状态。"

[Warcries.A_HoldPositions H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="%buff3.buff.stat1 %ICON_DEFENSE 防御赋予友方生物，%buff3.buff.stat2 %ICON_ATTACK 攻击赋予友方近战生物。移动的生物会失去‘坚守阵地！’效果。\n持续 %buff1.buff.durnow 战斗回合。"
mName="坚守阵地！"
mTooltip="%buff2.buff.stat %ICON_DEFENSE 防御赋予友方生物。移动的生物会失去‘坚守阵地！’效果。\n持续 %buff1.buff.durnow 战斗回合。"

[Warcries.A_HoldPositions_Buff_Creature_Melee_AwarenessUpgrade H7BaseBuff]
mName="坚守阵地！"
mTooltip="%stat2 %ICON_ATTACK 攻击\n%stat1 %ICON_DEFENSE 防御\n持续 %durnow 回合，或直到该生物移动。"

[A_ArtillerySupport_Buff H7BaseBuff]
mName="炮火支援"
mTooltip="如果被攻击的友方生物进行反击，则战争单位会向攻击者射击。\n持续 %durnow 战斗回合。"

[Warcries.A_HoldPositions_Buff_Hero H7BaseBuff]
mName="坚守阵地！"
mTooltip="所有友方生物拥有 %buff.buff.stat %ICON_DEFENSE 防御，只要此战嚎处于激活状态。生物移动时会失去此战嚎效果。"

[Warcries.A_Engage_Buff_Creature_OnslaughtUpgrade H7BaseBuff]
mName="冲锋！"
mTooltip="%stat %icon_attack 攻击\n%special %icon_attack 攻击（当攻击一个不会反击的敌方生物时）。\n持续 %durnow 战斗回合。"

[Warcries.A_OpenFire H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="%buff4.buff.stat %ICON_ATTACK 攻击赋予友方远程生物。他们的远程攻击现在可以进行侧击和全力侧击。\n持续 %buff1.buff.durnow 战斗回合。"
mName="开火！"
mTooltip="%buff2.buff.stat %ICON_ATTACK 攻击赋予友方远程生物。\n持续 %buff1.buff.durnow 战斗回合。"

[Warcries.A_Attention_Buff_Hero H7BaseBuff]
mName="立正！"
mTooltip="所有友方生物拥有 %buff.buff.stat1 %ICON_ATTACK 攻击和 %buff.buff.stat2 %ICON_DEFENSE 防御，只要此战嚎处于激活状态。"

[Warcries.A_OpenFire_Buff_Hero H7BaseBuff]
mName="开火！"
mTooltip="所有友方远程生物拥有 %buff.buff.stat %buff.buff.stat.icon 攻击，只要此战嚎处于激活状态。"

[Warcries.A_Attention H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="%buff5.buff.stat1 %ICON_ATTACK 攻击和 %buff5.buff.stat2 %ICON_DEFENSE 防御赋予友方生物。\n如果该生物反击，则攻击型战争单位也会向攻击者射击。\n持续 %buff1.buff.durnow 战斗回合。"
mName="立正！"
mTooltip="%buff3.buff.stat1 %ICON_ATTACK 攻击和 %buff3.buff.stat2 %ICON_DEFENSE 防御赋予友方生物。\n持续 %buff1.buff.durnow 战斗回合。"

[Warcries.A_Engage H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="%buff2.buff.stat %icon_attack 攻击赋予友方近战生物。\n%buff4.buff.special %icon_attack 攻击（当攻击一个不会反击的敌方生物时）。\n持续 %buff1.buff.durnow 战斗回合。"
mName="冲锋！"
mTooltip="%buff2.buff.stat %buff2.buff.stat.icon 攻击赋予友方近战生物。\n持续 %buff1.buff.durnow 战斗回合。"

[Warcries.A_HoldPositions_Buff_Creature_Ranged_AwarenessUpgrade H7BaseBuff]
mName="坚守阵地！"
mTooltip="%stat %ICON_DEFENSE 防御\n持续 %durnow 回合，或直到该生物移动。"

[Warcries.A_Engage_Buff_Creature H7BaseBuff]
mName="冲锋！"
mTooltip="%stat %stat.icon 攻击赋予友方近战生物。\n持续 %durnow 战斗回合。"

[Warcries.A_Attention_Buff_Creature H7BaseBuff]
mName="立正！"
mTooltip="%stat1 %ICON_ATTACK 攻击\n%stat2 %ICON_DEFENSE 防御\n持续 %durnow 战斗回合。"

[A_Overwhelm_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奇袭压制"
mTooltip="%spell.spell.name 战嚎额外增加友方生物的侧击和全力侧击伤害加成 %spell.spell.buff3.buff.stat3.norm 个百分点。"

[A_Alertness_Ability H7HeroAbility]
mName="眼观六路"
mTooltip="“坚守阵地！”战嚎获得以下额外效果：友方生物无法被全力侧击，相应的攻击只会获得侧击加成。"
[Warcries.A_HoldPositions_Buff_Creature_AlertnessUpgrade H7BaseBuff]
mName="坚守阵地！"
mTooltip="该生物获得 +0 防御。从背后侧击此生物不会造成额外伤害。此增益在该生物移动时消失。"
[Warcries.A_HoldPositions_Buff_Creature_Melee H7BaseBuff]
mName="坚守阵地！"
mTooltip="该生物获得 +0 攻击。此增益在该生物移动时消失。"
[Warcries.A_HoldPositions_Buff_Creature_AwarenessUpgrade H7BaseBuff]
mName="坚守阵地！"
mTooltip="该生物获得 +0 防御。从背后侧击此生物不会造成额外伤害。此增益在该生物移动时消失。"


v1.37

[Skill.A_resistance_arcanique_Buff_Creature_1 H7BaseBuff]
mName="奥术抗性"
mTooltip="%res 魔法伤害。"

[Skill.A_resistance_arcanique_Buff_Creature_2 H7BaseBuff]
mName="奥术抗性"
mTooltip="%res 魔法伤害。"

[Skill.A_resistance_arcanique_Buff_Creature_3 H7BaseBuff]
mName="奥术抗性"
mTooltip="%res 魔法伤害。"

[Skill.A_resistance_arcanique_Buff_Creature_4 H7BaseBuff]
mName="奥术抗性"
mTooltip="%res 魔法伤害。"

[Skill.A_resistance_arcanique_Buff_Creature_5 H7BaseBuff]
mName="奥术抗性"
mTooltip="%res 魔法伤害。"

[Skill.A_resistance_arcanique_Buff_Creature_6 H7BaseBuff]
mName="奥术抗性"
mTooltip="%res 魔法伤害。"

[Skill.A_Resitance_arcanique_Buff_Hero_1 H7BaseBuff]
mName="奥术抗性"
mTooltip=""

[Skill.A_Resitance_arcanique_Buff_Hero_2 H7BaseBuff]
mName="奥术抗性"
mTooltip=""

[Skill.A_Resitance_arcanique_Buff_Hero_3 H7BaseBuff]
mName="奥术抗性"
mTooltip=""

[Skill.A_Resitance_arcanique_Buff_Hero_4 H7BaseBuff]
mName="奥术抗性"
mTooltip=""

[Skill.A_Resitance_arcanique_Buff_Hero_5 H7BaseBuff]
mName="奥术抗性"
mTooltip=""

[Skill.A_Resitance_arcanique_Buff_Hero_6 H7BaseBuff]
mName="奥术抗性"
mTooltip=""

[Warcries.A_Advance H7HeroAbility]
mName="前进！"
mTooltip="%buff2.buff.stat1 %buff2.buff.stat1.icon 士气和 %buff2.buff.stat2 %buff2.buff.stat2.icon 移动力赋予友方生物。\n持续 %buff2.buff.durnow 战斗回合。"
mTooltipUpgraded="%buff2.buff.stat1 %buff2.buff.stat1.icon 士气和 %buff2.buff.stat2 %buff2.buff.stat2.icon 移动力赋予友方生物。\n该生物的侧击和全力侧击伤害加成增加 %buff3.buff.stat3.norm 个百分点。\n持续 %buff2.buff.durnow 战斗回合。\n冷却时间：%buff9.buff.durini 回合。"

[Warcries.A_Advance_Buff_Creature H7BaseBuff]
mName="前进！"
mTooltip="%stat1 %stat1.icon 士气\n%stat2 %stat2.icon 移动力。\n持续 %durnow 战斗回合。"

[Warcries.A_Advance_Buff_Creature_OverwhelmUpgrade H7BaseBuff]
mName="前进！"
mTooltip="%stat1 %stat1.icon 士气\n%stat2 %stat2.icon 移动力。\n该生物的侧击和全力侧击伤害加成增加 %stat3.norm 个百分点。\n持续 %durnow 战斗回合。"

[Warcries.A_Advance_Buff_Hero H7BaseBuff]
mName="前进！"
mTooltip="所有友方生物获得 %buff.buff.stat1 %buff.buff.stat1.icon 主动性和 %buff.buff.stat2 %buff.buff.stat2.icon 移动力，只要此战嚎处于激活状态。"

[Warcries.A_Regeneration H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded="复活该单位自战斗开始以来损失的 %buff2.buff.special %icon_health 生命值的生物。如果该单位遭受了 %spell4.name 法术影响，则恢复 %buff3.buff.special %icon_health 生命值。\n该生物同时获得 %buff6.buff.stat1 %icon_defense 防御和 %icon_health 生命值增加 %buff6.buff.stat2，持续 %buff6.buff.durini 回合。\n（每场战斗一次。）"
mName="生命灵药"
mTooltip="复活该单位自战斗开始以来损失的 %buff2.buff.special %icon_health 生命值的生物。如果该生物遭受了 %spell4.name 法术影响，则恢复 %buff3.buff.special %icon_health 生命值。\n（每场战斗一次。）"

[Warcries.A_HoldPositions_Buff_Creature_implosion H7BaseBuff]
mName="生命灵药"
mTooltip=""

[Warcries.A_HoldPositions_Buff_Creature H7BaseBuff]
mName="生命灵药"
mTooltip=""

[Warcries.A_OpenFire_Buff_Creature_ViciousShotUpgrade H7BaseBuff]
mName="开火！"
mTooltip="%stat %stat.icon 攻击\n该生物可以用其远程攻击进行侧击和全力侧击。\n持续 %durnow 战斗回合。"

[Warcries.A_OpenFire_Buff_Creature H7BaseBuff]
mName="开火！"
mTooltip="%stat %stat.icon 攻击\n持续 %durnow 战斗回合。"

[Warcries2.A_LightningBolt H7HeroAbility]
mName="威慑"
mTooltip="目标敌方生物获得 %buff1.buff.stat1 %icon_morale 士气，并且无法反击，持续 %buff1.buff.durini 回合。\n冷却时间：%buff9.buff.durini 回合"
mTooltipUpgraded="目标敌方生物获得 %buff1.buff.stat1 %icon_moral 士气，%buff2.buff.stat3 %icon_defense 防御，%buff2.buff.stat4 %icon_attack 攻击，并且无法反击，持续 %buff2.buff.durini 战斗回合。\n冷却时间：%buff9.buff.durini 回合。"

[Warcries2.A_Nova_2 H7HeroAbility]
mName="威慑"
mTooltipUpgraded=""
mTooltip=""

[Warcries.A_intimidation_Buff_Creature H7BaseBuff]
mName="被威慑"
%stat1 %icon_moral 士气。\n该生物本回合无法反击。"

[Warcries.A_intimidation_Buff_Creature_upregate H7BaseBuff]
mName="被威慑"
mTooltip="%stat1 %icon_moral 士气，%stat3 %icon_defense 防御，%stat4 %icon_attack 攻击。\n该生物本回合无法反击。"

[A_Opportunism_Ability H7HeroAbility]
mName="投机取巧"
mTooltip="每当英雄发动战嚎时，受影响单位获得 %spell.spell.buff4.buff.stat %spell.spell.buff4.buff.stat.icon 幸运直到回合结束，受影响对手获得 %spell.spell.buff5.buff.stat %spell.spell.buff5.buff.stat.icon 幸运。"

[A_Opportunism_deBuff H7BaseBuff]
mName="投机取巧"
mTooltip="%stat %stat.icon 幸运直到回合结束。"

[A_Opportunism_Buff H7BaseBuff]
mName="投机取巧"
mTooltip="%stat %stat.icon 幸运直到回合结束。"

[Warcries2.A_potion_upregate H7BaseBuff]
mName="强化药剂"
mTooltip="%stat1 %icon_defense 防御和 %stat2 %icon_health 生命值。\n持续 %durnow 战斗回合。"

[A_Awareness_Ability H7HeroAbility]
mName="强化药剂"
mTooltip="%spell.spell.name 赋予一个单位 +10 %ICON_DEFENSE 防御和 +20% %icon_health 生命值。"

[A_ViciousShot_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="恶毒射击"
mTooltip="%spell.spell.name 战嚎额外增加远程生物的 %spell.spell.buff4.buff.stat.icon 攻击 8 点，并且友方生物可以用远程攻击进行侧击和全力侧击。"

[A_Onslaught_Ability H7HeroAbility]
mName="淬毒之刃"
mTooltip="英雄的攻击会使目标中毒，在其下一回合开始时造成相当于该生物总生命值 1% 的伤害。该伤害每 3 级 %icon_ARCANE_KNOWLEDGE 源力知识增加一次，在 15 级 %icon_ARCANE_KNOWLEDGE 源力知识时最高可达 8%。\n此毒药无解。"

[A_ArtillerySupport_Ability H7HeroAbility]
mName="嗜睡术"
mTooltip="战嚎 %spell.spell.name 同时降低目标的 %icon_attack 攻击和 %icon_defense 防御 50%，并且持续时间延长 1 回合。"

[Warcries2.A_Poison_absolut1 H7BaseBuff]
mName="刀刃剧毒 1"
mTooltip="在其下一回合开始时，该生物受到相当于队伍总生命值 %d 的中毒伤害。\n（此伤害无法通过毒免疫来预防。）"

[Warcries2.A_Poison_absolut2 H7BaseBuff]
mName="刀刃剧毒 2"
mTooltip="在其下一回合开始时，该生物受到相当于队伍总生命值 %d 的中毒伤害。\n（此伤害无法通过毒免疫来预防。）"

[Warcries2.A_Poison_absolut3 H7BaseBuff]
mName="刀刃剧毒 3"
mTooltip="在其下一回合开始时，该生物受到相当于队伍总生命值 %d 的中毒伤害。\n（此伤害无法通过毒免疫来预防。）"

[Warcries2.A_Poison_absolut4 H7BaseBuff]
mName="刀刃剧毒 4"
mTooltip="在其下一回合开始时，该生物受到相当于队伍总生命值 %d 的中毒伤害。\n（此伤害无法通过毒免疫来预防。）"

[Warcries2.A_Poison_absolut5 H7BaseBuff]
mName="刀刃剧毒 5"
mTooltip="在其下一回合开始时，该生物受到相当于队伍总生命值 %d 的中毒伤害。\n（此伤害无法通过毒免疫来预防。）"

[Warcries2.A_Poison_absolut6 H7BaseBuff]
mName="刀刃剧毒 6"
mTooltip="在其下一回合开始时，该生物受到相当于队伍总生命值 %d 的中毒伤害。\n（此伤害无法通过毒免疫来预防。）"

[Warcries.A_LightningBolt H7HeroAbility]
mName="英雄打击"
mTooltip="对 2x2 区域内的生物和战争单位造成 %d1.max 伤害（每英雄等级 15 点伤害）。\n在攻城期间，对城墙或塔楼造成 %buff2.buff.d.max 伤害（每英雄等级 5 点伤害）。\n冷却时间：%buff9.buff.durini 回合。"
mTooltipUpgraded=""

v1.37/3

[Warcries.A_StormArrows H7HeroAbility]
mName="开火！"
mTooltip="%buff2.buff.stat %ICON_ATTACK 攻击赋予一个友方远程生物。\n同时获得能力 %spell7.name。\n持续 %buff2.buff.durnow 战斗回合。"
mTooltipUpgraded="%buff4.buff.stat %ICON_ATTACK 攻击赋予一个友方远程生物。远程攻击现在可以进行侧击和全力侧击。\n同时获得能力 %spell7.name。\n持续 %buff2.buff.durnow 战斗回合。\n冷却时间：%buff9.buff.durini 回合。"

v1.38

[A_Warlord_Ability H7HeroAbility]
mName="战争领主"
mTooltip="如果英雄本回合已经造成过伤害，并且一个友方生物被攻击，则英雄有 30% 的几率攻击攻击者。\n英雄获得 %stat %icon_ARCANE_KNOWLEDGE 源力知识。"

v1.41

[A_Warcries_Skill H7Skill]
mName="战嚎"
mTooltip="战嚎技能提示"
mDescriptions[0]="允许英雄发动战嚎来强化军队。\n每两级 %icon_ARCANE_KNOWLEDGE 源力知识提供 5% 魔法抗性（最高 30%）。"
mDescriptions[1]="允许英雄发动战嚎来强化军队。\n每两级 %icon_ARCANE_KNOWLEDGE 源力知识提供 5% 魔法抗性（最高 30%）。"
mDescriptions[2]="英雄可以发动战嚎 %spell1.spell.name 并使用 %spell2.spell.name。\n每两级 %icon_ARCANE_KNOWLEDGE 源力知识提供 5% 魔法抗性（最高 30%）。\n英雄获得 +1 %icon_ARCANE_KNOWLEDGE 源力知识。"
mDescriptions[3]="英雄可以发动战嚎 %spell3.spell.name 和 %spell4.spell.name。\n英雄获得 +1 %icon_ARCANE_KNOWLEDGE 源力知识。"
mDescriptions[4]="英雄可以发动战嚎 %spell5.spell.name。\n英雄获得 +1 %icon_ARCANE_KNOWLEDGE 源力知识。\n\n当与<font color=\"#00588BFF\">典范</font>技能达到大师级结合时，解锁<font color=\"#00FFCB44\">协同能力</font>：精英战士。"